run/icoPhaseChangeVoF/testEvaporation/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;

solver          icoPhaseChangeVoF;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1e-8;

deltaT          1e-08;

writeControl    adjustableRunTime;

writeInterval   1e-8;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.2;
maxAlphaCo      0.2;
maxDiCo         5.0;

maxDeltaT       1e-6;


// ************************************************************************* //

DebugSwitches
{
    evaporationModel 1;
}

OptimisationSwitches
{
    fileHandler collated;
}

functions
{
    #includeFunc cellMax;
    #includeFunc cellMin;
    #includeFunc evaporation;
}